#include <stdio.h>
#include <locale.h>

int main(int argc, char **argv)
{
	setlocale(LC_ALL, "ru_RU.UTF-8");
	printf("Таблица истинности выражения A<-->B=(A&&B)||(!A&&!B) \n");
	printf("Для удобства доказательства A<-->B поместим в последний стобец \n");
	printf("\n");
	printf("_____________________________________________________\n");
	printf("| A | B | A&&B | !A&&!B | (A&&B)||(!A&&!B) | A<-->B | \n");
	printf("_____________________________________________________\n");
	printf("| 0 | 0 |   0  |   1    |        1         |   1    | \n");
	printf("_____________________________________________________\n");
	printf("| 0 | 1 |   0  |   0    |        0         |   0    | \n");
	printf("_____________________________________________________\n");
	printf("| 1 | 0 |   0  |   0    |        0         |   0    | \n");
	printf("_____________________________________________________\n");
	printf("| 1 | 1 |   1  |   0    |        1         |   1    | \n");
	printf("_____________________________________________________\n");
	printf("\n");
	printf("\n");
	printf("Последние 2 стобца совпадают полностью. \n");
	printf("Значит тождество A<-->B=(A&&B)||(!A&&!B) Верно\n");
	return 0;
}

